docs/perf/raw/order-checkout-prepare-loadtest-guest-2026-03-31-rerun2.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: scripts/loadtest/order-checkout-no-confirm.k6.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 3m30s max duration (incl. graceful stop):
              * checkout_prepare_load: 200.00 iterations/s for 3m0s (maxVUs: 100, gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 3 complete and 0 interrupted iterations
checkout_prepare_load   [   1% ] 100/100 VUs  0m01.0s/3m0s  200.00 iters/s

running (0m01.9s), 100/100 VUs, 16 complete and 0 interrupted iterations
checkout_prepare_load   [   1% ] 100/100 VUs  0m01.9s/3m0s  200.00 iters/s

running (0m02.9s), 100/100 VUs, 25 complete and 0 interrupted iterations
checkout_prepare_load   [   2% ] 100/100 VUs  0m02.9s/3m0s  200.00 iters/s

running (0m03.9s), 100/100 VUs, 39 complete and 0 interrupted iterations
checkout_prepare_load   [   2% ] 100/100 VUs  0m03.9s/3m0s  200.00 iters/s

running (0m04.9s), 100/100 VUs, 50 complete and 0 interrupted iterations
checkout_prepare_load   [   3% ] 100/100 VUs  0m04.9s/3m0s  200.00 iters/s

running (0m05.9s), 100/100 VUs, 57 complete and 0 interrupted iterations
checkout_prepare_load   [   3% ] 100/100 VUs  0m05.9s/3m0s  200.00 iters/s

running (0m06.9s), 100/100 VUs, 60 complete and 0 interrupted iterations
checkout_prepare_load   [   4% ] 100/100 VUs  0m06.9s/3m0s  200.00 iters/s

running (0m07.9s), 100/100 VUs, 71 complete and 0 interrupted iterations
checkout_prepare_load   [   4% ] 100/100 VUs  0m07.9s/3m0s  200.00 iters/s

running (0m08.9s), 100/100 VUs, 73 complete and 0 interrupted iterations
checkout_prepare_load   [   5% ] 100/100 VUs  0m08.9s/3m0s  200.00 iters/s

running (0m10.0s), 100/100 VUs, 73 complete and 0 interrupted iterations
checkout_prepare_load   [   6% ] 100/100 VUs  0m10.0s/3m0s  200.00 iters/s

running (0m10.9s), 100/100 VUs, 73 complete and 0 interrupted iterations
checkout_prepare_load   [   6% ] 100/100 VUs  0m10.9s/3m0s  200.00 iters/s

running (0m11.9s), 100/100 VUs, 73 complete and 0 interrupted iterations
checkout_prepare_load   [   7% ] 100/100 VUs  0m11.9s/3m0s  200.00 iters/s

running (0m12.9s), 100/100 VUs, 90 complete and 0 interrupted iterations
checkout_prepare_load   [   7% ] 100/100 VUs  0m12.9s/3m0s  200.00 iters/s

running (0m13.9s), 100/100 VUs, 104 complete and 0 interrupted iterations
checkout_prepare_load   [   8% ] 100/100 VUs  0m13.9s/3m0s  200.00 iters/s

running (0m14.9s), 100/100 VUs, 116 complete and 0 interrupted iterations
checkout_prepare_load   [   8% ] 100/100 VUs  0m14.9s/3m0s  200.00 iters/s

running (0m15.9s), 100/100 VUs, 130 complete and 0 interrupted iterations
checkout_prepare_load   [   9% ] 100/100 VUs  0m15.9s/3m0s  200.00 iters/s

running (0m16.9s), 100/100 VUs, 138 complete and 0 interrupted iterations
checkout_prepare_load   [   9% ] 100/100 VUs  0m16.9s/3m0s  200.00 iters/s

running (0m17.9s), 100/100 VUs, 138 complete and 0 interrupted iterations
checkout_prepare_load   [  10% ] 100/100 VUs  0m17.9s/3m0s  200.00 iters/s

running (0m18.9s), 100/100 VUs, 138 complete and 0 interrupted iterations
checkout_prepare_load   [  11% ] 100/100 VUs  0m18.9s/3m0s  200.00 iters/s

running (0m19.9s), 100/100 VUs, 138 complete and 0 interrupted iterations
checkout_prepare_load   [  11% ] 100/100 VUs  0m19.9s/3m0s  200.00 iters/s

running (0m20.9s), 100/100 VUs, 138 complete and 0 interrupted iterations
checkout_prepare_load   [  12% ] 100/100 VUs  0m20.9s/3m0s  200.00 iters/s

running (0m22.0s), 100/100 VUs, 158 complete and 0 interrupted iterations
checkout_prepare_load   [  12% ] 100/100 VUs  0m22.0s/3m0s  200.00 iters/s

running (0m22.9s), 100/100 VUs, 178 complete and 0 interrupted iterations
checkout_prepare_load   [  13% ] 100/100 VUs  0m22.9s/3m0s  200.00 iters/s

running (0m23.9s), 100/100 VUs, 186 complete and 0 interrupted iterations
checkout_prepare_load   [  13% ] 100/100 VUs  0m23.9s/3m0s  200.00 iters/s

running (0m24.9s), 100/100 VUs, 190 complete and 0 interrupted iterations
checkout_prepare_load   [  14% ] 100/100 VUs  0m24.9s/3m0s  200.00 iters/s

running (0m25.9s), 100/100 VUs, 190 complete and 0 interrupted iterations
checkout_prepare_load   [  14% ] 100/100 VUs  0m25.9s/3m0s  200.00 iters/s

running (0m26.9s), 100/100 VUs, 190 complete and 0 interrupted iterations
checkout_prepare_load   [  15% ] 100/100 VUs  0m26.9s/3m0s  200.00 iters/s

running (0m27.9s), 100/100 VUs, 190 complete and 0 interrupted iterations
checkout_prepare_load   [  16% ] 100/100 VUs  0m27.9s/3m0s  200.00 iters/s

running (0m28.9s), 100/100 VUs, 190 complete and 0 interrupted iterations
checkout_prepare_load   [  16% ] 100/100 VUs  0m28.9s/3m0s  200.00 iters/s

running (0m29.9s), 100/100 VUs, 190 complete and 0 interrupted iterations
checkout_prepare_load   [  17% ] 100/100 VUs  0m29.9s/3m0s  200.00 iters/s

running (0m31.0s), 100/100 VUs, 200 complete and 0 interrupted iterations
checkout_prepare_load   [  17% ] 100/100 VUs  0m31.0s/3m0s  200.00 iters/s

running (0m31.9s), 100/100 VUs, 207 complete and 0 interrupted iterations
checkout_prepare_load   [  18% ] 100/100 VUs  0m31.9s/3m0s  200.00 iters/s

running (0m32.9s), 100/100 VUs, 213 complete and 0 interrupted iterations
checkout_prepare_load   [  18% ] 100/100 VUs  0m32.9s/3m0s  200.00 iters/s

running (0m33.9s), 100/100 VUs, 225 complete and 0 interrupted iterations
checkout_prepare_load   [  19% ] 100/100 VUs  0m33.9s/3m0s  200.00 iters/s

running (0m35.0s), 100/100 VUs, 244 complete and 0 interrupted iterations
checkout_prepare_load   [  19% ] 100/100 VUs  0m35.0s/3m0s  200.00 iters/s

running (0m35.9s), 100/100 VUs, 254 complete and 0 interrupted iterations
checkout_prepare_load   [  20% ] 100/100 VUs  0m35.9s/3m0s  200.00 iters/s

running (0m36.9s), 099/100 VUs, 257 complete and 0 interrupted iterations
checkout_prepare_load   [  21% ] 099/100 VUs  0m36.9s/3m0s  200.00 iters/s

running (0m37.9s), 100/100 VUs, 268 complete and 0 interrupted iterations
checkout_prepare_load   [  21% ] 100/100 VUs  0m37.9s/3m0s  200.00 iters/s

running (0m38.9s), 100/100 VUs, 272 complete and 0 interrupted iterations
checkout_prepare_load   [  22% ] 100/100 VUs  0m38.9s/3m0s  200.00 iters/s

running (0m39.9s), 100/100 VUs, 272 complete and 0 interrupted iterations
checkout_prepare_load   [  22% ] 100/100 VUs  0m39.9s/3m0s  200.00 iters/s

running (0m40.9s), 100/100 VUs, 272 complete and 0 interrupted iterations
checkout_prepare_load   [  23% ] 100/100 VUs  0m40.9s/3m0s  200.00 iters/s

running (0m41.9s), 100/100 VUs, 272 complete and 0 interrupted iterations
checkout_prepare_load   [  23% ] 100/100 VUs  0m41.9s/3m0s  200.00 iters/s

running (0m42.9s), 100/100 VUs, 287 complete and 0 interrupted iterations
checkout_prepare_load   [  24% ] 100/100 VUs  0m42.9s/3m0s  200.00 iters/s

running (0m43.9s), 100/100 VUs, 300 complete and 0 interrupted iterations
checkout_prepare_load   [  24% ] 100/100 VUs  0m43.9s/3m0s  200.00 iters/s

running (0m44.9s), 100/100 VUs, 308 complete and 0 interrupted iterations
checkout_prepare_load   [  25% ] 100/100 VUs  0m44.9s/3m0s  200.00 iters/s

running (0m45.9s), 100/100 VUs, 322 complete and 0 interrupted iterations
checkout_prepare_load   [  26% ] 100/100 VUs  0m45.9s/3m0s  200.00 iters/s

running (0m46.9s), 100/100 VUs, 336 complete and 0 interrupted iterations
checkout_prepare_load   [  26% ] 100/100 VUs  0m46.9s/3m0s  200.00 iters/s

running (0m47.9s), 100/100 VUs, 337 complete and 0 interrupted iterations
checkout_prepare_load   [  27% ] 100/100 VUs  0m47.9s/3m0s  200.00 iters/s

running (0m48.9s), 100/100 VUs, 337 complete and 0 interrupted iterations
checkout_prepare_load   [  27% ] 100/100 VUs  0m48.9s/3m0s  200.00 iters/s

running (0m49.9s), 100/100 VUs, 337 complete and 0 interrupted iterations
checkout_prepare_load   [  28% ] 100/100 VUs  0m49.9s/3m0s  200.00 iters/s

running (0m50.9s), 100/100 VUs, 337 complete and 0 interrupted iterations
checkout_prepare_load   [  28% ] 100/100 VUs  0m50.9s/3m0s  200.00 iters/s

running (0m51.9s), 100/100 VUs, 349 complete and 0 interrupted iterations
checkout_prepare_load   [  29% ] 100/100 VUs  0m51.9s/3m0s  200.00 iters/s

running (0m52.9s), 100/100 VUs, 361 complete and 0 interrupted iterations
checkout_prepare_load   [  29% ] 100/100 VUs  0m52.9s/3m0s  200.00 iters/s

running (0m53.9s), 100/100 VUs, 371 complete and 0 interrupted iterations
checkout_prepare_load   [  30% ] 100/100 VUs  0m53.9s/3m0s  200.00 iters/s

running (0m54.9s), 100/100 VUs, 387 complete and 0 interrupted iterations
checkout_prepare_load   [  31% ] 100/100 VUs  0m54.9s/3m0s  200.00 iters/s

running (0m55.9s), 100/100 VUs, 389 complete and 0 interrupted iterations
checkout_prepare_load   [  31% ] 100/100 VUs  0m55.9s/3m0s  200.00 iters/s

running (0m56.9s), 100/100 VUs, 389 complete and 0 interrupted iterations
checkout_prepare_load   [  32% ] 100/100 VUs  0m56.9s/3m0s  200.00 iters/s

running (0m57.9s), 100/100 VUs, 389 complete and 0 interrupted iterations
checkout_prepare_load   [  32% ] 100/100 VUs  0m57.9s/3m0s  200.00 iters/s

running (0m58.9s), 100/100 VUs, 389 complete and 0 interrupted iterations
checkout_prepare_load   [  33% ] 100/100 VUs  0m58.9s/3m0s  200.00 iters/s

running (0m59.9s), 100/100 VUs, 389 complete and 0 interrupted iterations
checkout_prepare_load   [  33% ] 100/100 VUs  0m59.9s/3m0s  200.00 iters/s

running (1m01.0s), 100/100 VUs, 395 complete and 0 interrupted iterations
checkout_prepare_load   [  34% ] 100/100 VUs  1m00.9s/3m0s  200.00 iters/s

running (1m01.9s), 100/100 VUs, 399 complete and 0 interrupted iterations
checkout_prepare_load   [  34% ] 100/100 VUs  1m01.9s/3m0s  200.00 iters/s

running (1m02.9s), 100/100 VUs, 403 complete and 0 interrupted iterations
checkout_prepare_load   [  35% ] 100/100 VUs  1m02.9s/3m0s  200.00 iters/s

running (1m03.9s), 100/100 VUs, 410 complete and 0 interrupted iterations
checkout_prepare_load   [  36% ] 100/100 VUs  1m03.9s/3m0s  200.00 iters/s

running (1m04.9s), 100/100 VUs, 420 complete and 0 interrupted iterations
checkout_prepare_load   [  36% ] 100/100 VUs  1m04.9s/3m0s  200.00 iters/s

running (1m05.9s), 100/100 VUs, 425 complete and 0 interrupted iterations
checkout_prepare_load   [  37% ] 100/100 VUs  1m05.9s/3m0s  200.00 iters/s

running (1m06.9s), 100/100 VUs, 431 complete and 0 interrupted iterations
checkout_prepare_load   [  37% ] 100/100 VUs  1m06.9s/3m0s  200.00 iters/s

running (1m08.0s), 100/100 VUs, 458 complete and 0 interrupted iterations
checkout_prepare_load   [  38% ] 100/100 VUs  1m08.0s/3m0s  200.00 iters/s

running (1m08.9s), 100/100 VUs, 470 complete and 0 interrupted iterations
checkout_prepare_load   [  38% ] 100/100 VUs  1m08.9s/3m0s  200.00 iters/s

running (1m10.0s), 100/100 VUs, 471 complete and 0 interrupted iterations
checkout_prepare_load   [  39% ] 100/100 VUs  1m10.1s/3m0s  200.00 iters/s

running (1m10.9s), 100/100 VUs, 471 complete and 0 interrupted iterations
checkout_prepare_load   [  39% ] 100/100 VUs  1m10.9s/3m0s  200.00 iters/s

running (1m12.0s), 100/100 VUs, 471 complete and 0 interrupted iterations
checkout_prepare_load   [  40% ] 100/100 VUs  1m11.9s/3m0s  200.00 iters/s

running (1m12.9s), 100/100 VUs, 481 complete and 0 interrupted iterations
checkout_prepare_load   [  41% ] 100/100 VUs  1m12.9s/3m0s  200.00 iters/s

running (1m13.9s), 100/100 VUs, 497 complete and 0 interrupted iterations
checkout_prepare_load   [  41% ] 100/100 VUs  1m13.9s/3m0s  200.00 iters/s

running (1m15.0s), 100/100 VUs, 506 complete and 0 interrupted iterations
checkout_prepare_load   [  42% ] 100/100 VUs  1m15.0s/3m0s  200.00 iters/s

running (1m15.9s), 100/100 VUs, 514 complete and 0 interrupted iterations
checkout_prepare_load   [  42% ] 100/100 VUs  1m15.9s/3m0s  200.00 iters/s

running (1m16.9s), 100/100 VUs, 527 complete and 0 interrupted iterations
checkout_prepare_load   [  43% ] 100/100 VUs  1m16.9s/3m0s  200.00 iters/s

running (1m17.9s), 100/100 VUs, 531 complete and 0 interrupted iterations
checkout_prepare_load   [  43% ] 100/100 VUs  1m17.9s/3m0s  200.00 iters/s

running (1m18.9s), 100/100 VUs, 536 complete and 0 interrupted iterations
checkout_prepare_load   [  44% ] 100/100 VUs  1m18.9s/3m0s  200.00 iters/s

running (1m19.9s), 100/100 VUs, 536 complete and 0 interrupted iterations
checkout_prepare_load   [  44% ] 100/100 VUs  1m19.9s/3m0s  200.00 iters/s

running (1m20.9s), 100/100 VUs, 536 complete and 0 interrupted iterations
checkout_prepare_load   [  45% ] 100/100 VUs  1m20.9s/3m0s  200.00 iters/s

running (1m21.9s), 100/100 VUs, 543 complete and 0 interrupted iterations
checkout_prepare_load   [  46% ] 100/100 VUs  1m21.9s/3m0s  200.00 iters/s

running (1m22.9s), 100/100 VUs, 552 complete and 0 interrupted iterations
checkout_prepare_load   [  46% ] 100/100 VUs  1m22.9s/3m0s  200.00 iters/s

running (1m23.9s), 100/100 VUs, 567 complete and 0 interrupted iterations
checkout_prepare_load   [  47% ] 100/100 VUs  1m23.9s/3m0s  200.00 iters/s

running (1m24.9s), 100/100 VUs, 582 complete and 0 interrupted iterations
checkout_prepare_load   [  47% ] 100/100 VUs  1m24.9s/3m0s  200.00 iters/s

running (1m25.9s), 100/100 VUs, 586 complete and 0 interrupted iterations
checkout_prepare_load   [  48% ] 100/100 VUs  1m25.9s/3m0s  200.00 iters/s

running (1m26.9s), 100/100 VUs, 587 complete and 0 interrupted iterations
checkout_prepare_load   [  48% ] 100/100 VUs  1m26.9s/3m0s  200.00 iters/s

running (1m27.9s), 100/100 VUs, 588 complete and 0 interrupted iterations
checkout_prepare_load   [  49% ] 100/100 VUs  1m27.9s/3m0s  200.00 iters/s

running (1m28.9s), 100/100 VUs, 588 complete and 0 interrupted iterations
checkout_prepare_load   [  49% ] 100/100 VUs  1m28.9s/3m0s  200.00 iters/s

running (1m29.9s), 100/100 VUs, 588 complete and 0 interrupted iterations
checkout_prepare_load   [  50% ] 100/100 VUs  1m29.9s/3m0s  200.00 iters/s

running (1m30.9s), 100/100 VUs, 591 complete and 0 interrupted iterations
checkout_prepare_load   [  51% ] 100/100 VUs  1m30.9s/3m0s  200.00 iters/s

running (1m31.9s), 100/100 VUs, 597 complete and 0 interrupted iterations
checkout_prepare_load   [  51% ] 100/100 VUs  1m31.9s/3m0s  200.00 iters/s

running (1m32.9s), 100/100 VUs, 601 complete and 0 interrupted iterations
checkout_prepare_load   [  52% ] 100/100 VUs  1m32.9s/3m0s  200.00 iters/s

running (1m33.9s), 100/100 VUs, 605 complete and 0 interrupted iterations
checkout_prepare_load   [  52% ] 100/100 VUs  1m33.9s/3m0s  200.00 iters/s

running (1m34.9s), 100/100 VUs, 612 complete and 0 interrupted iterations
checkout_prepare_load   [  53% ] 100/100 VUs  1m34.9s/3m0s  200.00 iters/s

running (1m35.9s), 100/100 VUs, 622 complete and 0 interrupted iterations
checkout_prepare_load   [  53% ] 100/100 VUs  1m35.9s/3m0s  200.00 iters/s

running (1m36.9s), 100/100 VUs, 627 complete and 0 interrupted iterations
checkout_prepare_load   [  54% ] 100/100 VUs  1m36.9s/3m0s  200.00 iters/s

running (1m37.9s), 100/100 VUs, 649 complete and 0 interrupted iterations
checkout_prepare_load   [  54% ] 100/100 VUs  1m37.9s/3m0s  200.00 iters/s

running (1m38.9s), 100/100 VUs, 664 complete and 0 interrupted iterations
checkout_prepare_load   [  55% ] 100/100 VUs  1m38.9s/3m0s  200.00 iters/s

running (1m39.9s), 100/100 VUs, 666 complete and 0 interrupted iterations
checkout_prepare_load   [  56% ] 100/100 VUs  1m39.9s/3m0s  200.00 iters/s

running (1m40.9s), 100/100 VUs, 666 complete and 0 interrupted iterations
checkout_prepare_load   [  56% ] 100/100 VUs  1m40.9s/3m0s  200.00 iters/s

running (1m41.9s), 100/100 VUs, 666 complete and 0 interrupted iterations
checkout_prepare_load   [  57% ] 100/100 VUs  1m41.9s/3m0s  200.00 iters/s

running (1m42.9s), 100/100 VUs, 673 complete and 0 interrupted iterations
checkout_prepare_load   [  57% ] 100/100 VUs  1m42.9s/3m0s  200.00 iters/s

running (1m43.9s), 100/100 VUs, 690 complete and 0 interrupted iterations
checkout_prepare_load   [  58% ] 100/100 VUs  1m43.9s/3m0s  200.00 iters/s

running (1m44.9s), 100/100 VUs, 697 complete and 0 interrupted iterations
checkout_prepare_load   [  58% ] 100/100 VUs  1m44.9s/3m0s  200.00 iters/s

running (1m45.9s), 100/100 VUs, 710 complete and 0 interrupted iterations
checkout_prepare_load   [  59% ] 100/100 VUs  1m45.9s/3m0s  200.00 iters/s

running (1m46.9s), 100/100 VUs, 719 complete and 0 interrupted iterations
checkout_prepare_load   [  59% ] 100/100 VUs  1m46.9s/3m0s  200.00 iters/s

running (1m47.9s), 100/100 VUs, 722 complete and 0 interrupted iterations
checkout_prepare_load   [  60% ] 100/100 VUs  1m47.9s/3m0s  200.00 iters/s

running (1m48.9s), 100/100 VUs, 726 complete and 0 interrupted iterations
checkout_prepare_load   [  61% ] 100/100 VUs  1m48.9s/3m0s  200.00 iters/s

running (1m49.9s), 100/100 VUs, 726 complete and 0 interrupted iterations
checkout_prepare_load   [  61% ] 100/100 VUs  1m49.9s/3m0s  200.00 iters/s

running (1m50.9s), 100/100 VUs, 726 complete and 0 interrupted iterations
checkout_prepare_load   [  62% ] 100/100 VUs  1m50.9s/3m0s  200.00 iters/s

running (1m51.9s), 100/100 VUs, 729 complete and 0 interrupted iterations
checkout_prepare_load   [  62% ] 100/100 VUs  1m51.9s/3m0s  200.00 iters/s

running (1m52.9s), 100/100 VUs, 734 complete and 0 interrupted iterations
checkout_prepare_load   [  63% ] 100/100 VUs  1m52.9s/3m0s  200.00 iters/s

running (1m53.9s), 100/100 VUs, 741 complete and 0 interrupted iterations
checkout_prepare_load   [  63% ] 100/100 VUs  1m53.9s/3m0s  200.00 iters/s

running (1m54.9s), 100/100 VUs, 749 complete and 0 interrupted iterations
checkout_prepare_load   [  64% ] 100/100 VUs  1m54.9s/3m0s  200.00 iters/s

running (1m55.9s), 100/100 VUs, 751 complete and 0 interrupted iterations
checkout_prepare_load   [  64% ] 100/100 VUs  1m56.0s/3m0s  200.00 iters/s

running (1m56.9s), 100/100 VUs, 761 complete and 0 interrupted iterations
checkout_prepare_load   [  65% ] 100/100 VUs  1m56.9s/3m0s  200.00 iters/s

running (1m57.9s), 100/100 VUs, 764 complete and 0 interrupted iterations
checkout_prepare_load   [  66% ] 100/100 VUs  1m57.9s/3m0s  200.00 iters/s

running (1m59.0s), 100/100 VUs, 764 complete and 0 interrupted iterations
checkout_prepare_load   [  66% ] 100/100 VUs  1m59.0s/3m0s  200.00 iters/s

running (1m59.9s), 100/100 VUs, 764 complete and 0 interrupted iterations
checkout_prepare_load   [  67% ] 100/100 VUs  1m59.9s/3m0s  200.00 iters/s

running (2m00.9s), 100/100 VUs, 771 complete and 0 interrupted iterations
checkout_prepare_load   [  67% ] 100/100 VUs  2m00.9s/3m0s  200.00 iters/s

running (2m01.9s), 100/100 VUs, 793 complete and 0 interrupted iterations
checkout_prepare_load   [  68% ] 100/100 VUs  2m01.9s/3m0s  200.00 iters/s

running (2m02.9s), 100/100 VUs, 798 complete and 0 interrupted iterations
checkout_prepare_load   [  68% ] 100/100 VUs  2m02.9s/3m0s  200.00 iters/s

running (2m03.9s), 100/100 VUs, 801 complete and 0 interrupted iterations
checkout_prepare_load   [  69% ] 100/100 VUs  2m03.9s/3m0s  200.00 iters/s

running (2m04.9s), 100/100 VUs, 806 complete and 0 interrupted iterations
checkout_prepare_load   [  69% ] 100/100 VUs  2m04.9s/3m0s  200.00 iters/s

running (2m05.9s), 100/100 VUs, 820 complete and 0 interrupted iterations
checkout_prepare_load   [  70% ] 100/100 VUs  2m05.9s/3m0s  200.00 iters/s

running (2m06.9s), 100/100 VUs, 825 complete and 0 interrupted iterations
checkout_prepare_load   [  71% ] 100/100 VUs  2m06.9s/3m0s  200.00 iters/s

running (2m07.9s), 100/100 VUs, 842 complete and 0 interrupted iterations
checkout_prepare_load   [  71% ] 100/100 VUs  2m07.9s/3m0s  200.00 iters/s

running (2m08.9s), 100/100 VUs, 857 complete and 0 interrupted iterations
checkout_prepare_load   [  72% ] 100/100 VUs  2m08.9s/3m0s  200.00 iters/s

running (2m09.9s), 100/100 VUs, 864 complete and 0 interrupted iterations
checkout_prepare_load   [  72% ] 100/100 VUs  2m09.9s/3m0s  200.00 iters/s

running (2m10.9s), 100/100 VUs, 866 complete and 0 interrupted iterations
checkout_prepare_load   [  73% ] 100/100 VUs  2m10.9s/3m0s  200.00 iters/s

running (2m11.9s), 100/100 VUs, 866 complete and 0 interrupted iterations
checkout_prepare_load   [  73% ] 100/100 VUs  2m11.9s/3m0s  200.00 iters/s

running (2m12.9s), 100/100 VUs, 870 complete and 0 interrupted iterations
checkout_prepare_load   [  74% ] 100/100 VUs  2m12.9s/3m0s  200.00 iters/s

running (2m13.9s), 100/100 VUs, 885 complete and 0 interrupted iterations
checkout_prepare_load   [  74% ] 100/100 VUs  2m13.9s/3m0s  200.00 iters/s

running (2m14.9s), 100/100 VUs, 890 complete and 0 interrupted iterations
checkout_prepare_load   [  75% ] 100/100 VUs  2m14.9s/3m0s  200.00 iters/s

running (2m15.9s), 099/100 VUs, 909 complete and 0 interrupted iterations
checkout_prepare_load   [  76% ] 099/100 VUs  2m15.9s/3m0s  200.00 iters/s

running (2m16.9s), 100/100 VUs, 917 complete and 0 interrupted iterations
checkout_prepare_load   [  76% ] 100/100 VUs  2m16.9s/3m0s  200.00 iters/s

running (2m18.0s), 100/100 VUs, 921 complete and 0 interrupted iterations
checkout_prepare_load   [  77% ] 100/100 VUs  2m18.0s/3m0s  200.00 iters/s

running (2m18.9s), 100/100 VUs, 926 complete and 0 interrupted iterations
checkout_prepare_load   [  77% ] 100/100 VUs  2m18.9s/3m0s  200.00 iters/s

running (2m19.9s), 100/100 VUs, 926 complete and 0 interrupted iterations
checkout_prepare_load   [  78% ] 100/100 VUs  2m19.9s/3m0s  200.00 iters/s

running (2m20.9s), 100/100 VUs, 926 complete and 0 interrupted iterations
checkout_prepare_load   [  78% ] 100/100 VUs  2m20.9s/3m0s  200.00 iters/s

running (2m21.9s), 100/100 VUs, 928 complete and 0 interrupted iterations
checkout_prepare_load   [  79% ] 100/100 VUs  2m21.9s/3m0s  200.00 iters/s

running (2m22.9s), 100/100 VUs, 933 complete and 0 interrupted iterations
checkout_prepare_load   [  79% ] 100/100 VUs  2m22.9s/3m0s  200.00 iters/s

running (2m23.9s), 100/100 VUs, 938 complete and 0 interrupted iterations
checkout_prepare_load   [  80% ] 100/100 VUs  2m23.9s/3m0s  200.00 iters/s

running (2m24.9s), 100/100 VUs, 948 complete and 0 interrupted iterations
checkout_prepare_load   [  81% ] 100/100 VUs  2m24.9s/3m0s  200.00 iters/s

running (2m25.9s), 100/100 VUs, 950 complete and 0 interrupted iterations
checkout_prepare_load   [  81% ] 100/100 VUs  2m25.9s/3m0s  200.00 iters/s

running (2m26.9s), 100/100 VUs, 957 complete and 0 interrupted iterations
checkout_prepare_load   [  82% ] 100/100 VUs  2m26.9s/3m0s  200.00 iters/s

running (2m27.9s), 100/100 VUs, 964 complete and 0 interrupted iterations
checkout_prepare_load   [  82% ] 100/100 VUs  2m27.9s/3m0s  200.00 iters/s

running (2m28.9s), 100/100 VUs, 964 complete and 0 interrupted iterations
checkout_prepare_load   [  83% ] 100/100 VUs  2m28.9s/3m0s  200.00 iters/s

running (2m29.9s), 100/100 VUs, 964 complete and 0 interrupted iterations
checkout_prepare_load   [  83% ] 100/100 VUs  2m29.9s/3m0s  200.00 iters/s

running (2m30.9s), 100/100 VUs, 968 complete and 0 interrupted iterations
checkout_prepare_load   [  84% ] 100/100 VUs  2m30.9s/3m0s  200.00 iters/s

running (2m31.9s), 100/100 VUs, 982 complete and 0 interrupted iterations
checkout_prepare_load   [  84% ] 100/100 VUs  2m31.9s/3m0s  200.00 iters/s

running (2m33.0s), 099/100 VUs, 998 complete and 0 interrupted iterations
checkout_prepare_load   [  85% ] 099/100 VUs  2m33.0s/3m0s  200.00 iters/s

running (2m33.9s), 100/100 VUs, 999 complete and 0 interrupted iterations
checkout_prepare_load   [  86% ] 100/100 VUs  2m33.9s/3m0s  200.00 iters/s

running (2m34.9s), 100/100 VUs, 1003 complete and 0 interrupted iterations
checkout_prepare_load   [  86% ] 100/100 VUs  2m34.9s/3m0s  200.00 iters/s

running (2m35.9s), 100/100 VUs, 1012 complete and 0 interrupted iterations
checkout_prepare_load   [  87% ] 100/100 VUs  2m35.9s/3m0s  200.00 iters/s

running (2m36.9s), 100/100 VUs, 1015 complete and 0 interrupted iterations
checkout_prepare_load   [  87% ] 100/100 VUs  2m36.9s/3m0s  200.00 iters/s

running (2m37.9s), 100/100 VUs, 1024 complete and 0 interrupted iterations
checkout_prepare_load   [  88% ] 100/100 VUs  2m37.9s/3m0s  200.00 iters/s

running (2m38.9s), 100/100 VUs, 1031 complete and 0 interrupted iterations
checkout_prepare_load   [  88% ] 100/100 VUs  2m38.9s/3m0s  200.00 iters/s

running (2m39.9s), 100/100 VUs, 1035 complete and 0 interrupted iterations
checkout_prepare_load   [  89% ] 100/100 VUs  2m39.9s/3m0s  200.00 iters/s

running (2m41.1s), 100/100 VUs, 1036 complete and 0 interrupted iterations
checkout_prepare_load   [  89% ] 100/100 VUs  2m41.1s/3m0s  200.00 iters/s

running (2m41.9s), 100/100 VUs, 1036 complete and 0 interrupted iterations
checkout_prepare_load   [  90% ] 100/100 VUs  2m41.9s/3m0s  200.00 iters/s

running (2m42.9s), 100/100 VUs, 1038 complete and 0 interrupted iterations
checkout_prepare_load   [  91% ] 100/100 VUs  2m42.9s/3m0s  200.00 iters/s

running (2m43.9s), 100/100 VUs, 1045 complete and 0 interrupted iterations
checkout_prepare_load   [  91% ] 100/100 VUs  2m43.9s/3m0s  200.00 iters/s

running (2m44.9s), 100/100 VUs, 1048 complete and 0 interrupted iterations
checkout_prepare_load   [  92% ] 100/100 VUs  2m44.9s/3m0s  200.00 iters/s

running (2m45.9s), 100/100 VUs, 1057 complete and 0 interrupted iterations
checkout_prepare_load   [  92% ] 100/100 VUs  2m45.9s/3m0s  200.00 iters/s

running (2m46.9s), 100/100 VUs, 1061 complete and 0 interrupted iterations
checkout_prepare_load   [  93% ] 100/100 VUs  2m46.9s/3m0s  200.00 iters/s

running (2m47.9s), 100/100 VUs, 1063 complete and 0 interrupted iterations
checkout_prepare_load   [  93% ] 100/100 VUs  2m47.9s/3m0s  200.00 iters/s

running (2m48.9s), 100/100 VUs, 1066 complete and 0 interrupted iterations
checkout_prepare_load   [  94% ] 100/100 VUs  2m48.9s/3m0s  200.00 iters/s

running (2m49.9s), 100/100 VUs, 1066 complete and 0 interrupted iterations
checkout_prepare_load   [  94% ] 100/100 VUs  2m49.9s/3m0s  200.00 iters/s

running (2m50.9s), 100/100 VUs, 1066 complete and 0 interrupted iterations
checkout_prepare_load   [  95% ] 100/100 VUs  2m50.9s/3m0s  200.00 iters/s

running (2m51.9s), 100/100 VUs, 1067 complete and 0 interrupted iterations
checkout_prepare_load   [  96% ] 100/100 VUs  2m51.9s/3m0s  200.00 iters/s

running (2m53.0s), 100/100 VUs, 1069 complete and 0 interrupted iterations
checkout_prepare_load   [  96% ] 100/100 VUs  2m53.0s/3m0s  200.00 iters/s

running (2m53.9s), 100/100 VUs, 1072 complete and 0 interrupted iterations
checkout_prepare_load   [  97% ] 100/100 VUs  2m53.9s/3m0s  200.00 iters/s

running (2m54.9s), 100/100 VUs, 1077 complete and 0 interrupted iterations
checkout_prepare_load   [  97% ] 100/100 VUs  2m54.9s/3m0s  200.00 iters/s

running (2m55.9s), 100/100 VUs, 1078 complete and 0 interrupted iterations
checkout_prepare_load   [  98% ] 100/100 VUs  2m55.9s/3m0s  200.00 iters/s

running (2m56.9s), 100/100 VUs, 1081 complete and 0 interrupted iterations
checkout_prepare_load   [  98% ] 100/100 VUs  2m56.9s/3m0s  200.00 iters/s

running (2m57.9s), 100/100 VUs, 1085 complete and 0 interrupted iterations
checkout_prepare_load   [  99% ] 100/100 VUs  2m57.9s/3m0s  200.00 iters/s

running (2m58.9s), 100/100 VUs, 1085 complete and 0 interrupted iterations
checkout_prepare_load   [  99% ] 100/100 VUs  2m58.9s/3m0s  200.00 iters/s

running (2m59.9s), 100/100 VUs, 1085 complete and 0 interrupted iterations
checkout_prepare_load   [ 100% ] 100/100 VUs  2m59.9s/3m0s  200.00 iters/s

running (3m00.9s), 098/100 VUs, 1087 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m01.9s), 092/100 VUs, 1093 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m02.9s), 084/100 VUs, 1101 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m03.9s), 082/100 VUs, 1103 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m04.9s), 079/100 VUs, 1106 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m05.9s), 072/100 VUs, 1113 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m06.9s), 069/100 VUs, 1116 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m07.9s), 061/100 VUs, 1124 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m08.9s), 054/100 VUs, 1131 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m09.9s), 050/100 VUs, 1135 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m10.9s), 049/100 VUs, 1136 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m11.9s), 049/100 VUs, 1136 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m12.9s), 047/100 VUs, 1138 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m13.9s), 040/100 VUs, 1145 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m14.9s), 037/100 VUs, 1148 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m15.9s), 028/100 VUs, 1157 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m16.9s), 024/100 VUs, 1161 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m17.9s), 022/100 VUs, 1163 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m18.9s), 019/100 VUs, 1166 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m19.9s), 019/100 VUs, 1166 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m20.9s), 019/100 VUs, 1166 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m21.9s), 018/100 VUs, 1167 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m22.9s), 016/100 VUs, 1169 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m24.0s), 013/100 VUs, 1172 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m24.9s), 008/100 VUs, 1177 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m25.9s), 007/100 VUs, 1178 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m26.9s), 004/100 VUs, 1181 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m27.5s), 000/100 VUs, 1185 complete and 0 interrupted iterations
checkout_prepare_load ✓ [ 100% ] 000/100 VUs  3m0s  200.00 iters/s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<5000' p(95)=30.01s

    http_req_failed
    ✓ 'rate<0.99' rate=48.94%

    order_create_error_rate
    ✓ 'rate<0.99' rate=48.94%

    order_create_latency_ms
    ✗ 'p(99)<8000' p(99)=30.05s


  █ TOTAL RESULTS 

    CUSTOM
    order_create_error_rate........: 48.94% 580 out of 1185
    order_create_failure_total.....: 580    2.794563/s
    order_create_latency_ms........: avg=16.17s min=43.07ms med=21.63s   max=30.18s p(90)=30s   p(95)=30.01s p(99)=30.05s
    order_create_success_total.....: 605    2.915018/s

    HTTP
    http_req_duration..............: avg=16.17s min=43.07ms med=21.63s   max=30.18s p(90)=30s   p(95)=30.01s p(99)=30.05s
      { expected_response:true }...: avg=2.91s  min=43.07ms med=571.34ms max=29.97s p(90)=8.16s p(95)=20.98s p(99)=29.54s
    http_req_failed................: 48.94% 580 out of 1185
    http_reqs......................: 1185   5.709581/s

    EXECUTION
    dropped_iterations.............: 34825  167.794219/s
    iteration_duration.............: avg=16.18s min=43.81ms med=21.71s   max=30.38s p(90)=30s   p(95)=30.02s p(99)=30.08s
    iterations.....................: 1185   5.709581/s
    vus............................: 4      min=4           max=100
    vus_max........................: 100    min=100         max=100

    NETWORK
    data_received..................: 898 kB 4.3 kB/s
    data_sent......................: 659 kB 3.2 kB/s



running (3m27.5s), 000/100 VUs, 1185 complete and 0 interrupted iterations
checkout_prepare_load ✓ [ 100% ] 000/100 VUs  3m0s  200.00 iters/s